import Title from "@/components/Title";
import styles from "./RulesPage.module.css";

import { PiSealWarningBold } from "react-icons/pi";
import { MdOutlineRule } from "react-icons/md";
import Head2Home from "@/components/Head2Home";

function RulesPage() {
  const rules = [
    "استعمال دخانیات درون ساختمان خوابگاه ممنوع میباشد.",
    "هرگونه دعوا و برخورد با دیگران ممنوع است.",
    "استفاده از وسایل دیگران ممنوع میباشد.",
    "سر و صدا کردن در محیط خوابگاه ممنوع است.",
    "استفاده از سرویس های بهداشتی طبقات دیگر ممنوع میباشد.",
    "نظافت الزامی است.",
    "استفاده از حمام در ساعات بین 12 تا 7 صبع ممنوع میباشدو",
    "استفاده از وسایل تفریحی درون حیاط بعد از ساعت 11 مجاز نیست.",
    "کفش ها باید درون جاکفشی قرار بگیرد.",
    "مرتب بود اتاق و تخت الزامی است.",
    "ساعت خروج آزاد و ورود بین ساعات 12 شب تا 7 صب میباشد.",
    "پاکیزگی سرویس ها بهداشتی الزامیست.",
    "شستن ظروف الزامیست.",
    "تمیز کردن سینک ظرف شویی و آشپزخانه الزامیست.",
    "شستن لباس در حمام فقط برای لباس زیر و جوراب مجاز است.",
    "آوردن بالشت و پتوی شخصی ممنوع است.",
    "شهریه اول ماه پرداخت میشود.",
    "ده روز قبل از تسویه باید اعلام شود.",
    "هزینه شستن لباس با لباس شویی شخصی 50 هزار تومن میباشد.",
  ];
  return (
    <>
      <Head2Home
        svg={<MdOutlineRule />}
        title="قوانین خوابگاه"
        text="هرگونه رعایت نکردن از قوانین زیر، منجر به برخورد با خاطی توسط مدیران
        خوابگاه و اخراج خاطیان میشود."
      />
      <article className={styles.rules}>
        <Title title="قوانین خوابگاه آرامش" svg={<PiSealWarningBold />} />
        <ol>
          {rules.map((rule) => (
            <li key={rule}>{rule}</li>
          ))}
        </ol>
      </article>
    </>
  );
}

export default RulesPage;
